FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ТиповыеАнкеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТиповыеАнкеты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МакетАнкеты</Name>
					<Comment>Макет анкеты в виде двоичных данных</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеАнкеты</Name>
					<Comment>Наименование анкеты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вступление</Name>
					<Comment>Вступление анкеты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВопросыАнкеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОбязательностьЗаполненияОтветаНаВопрос</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВопросУсловия</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветУсловия</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеОтвета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыУсловийОбязательныхОтветов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесВопроса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СекундОтвета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЗначенийУсловия</Name>
					<Comment>Список значений, используемых в условии обязательности ответа на вопрос</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВопросВладелец</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСписка</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ТиповыеАнкеты/Ext/ObjectModule.bsl
// Модуль справочника Типовые анкеты

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

// Функция возвращает сформированный макет анкеты
//
Функция СформироватьМакет(ДокументМакет) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТиповаяАнкета",	Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТиповыеАнкетыВопросыАнкеты.Ссылка,
	|	ТиповыеАнкетыВопросыАнкеты.Вопрос КАК Вопрос,
	|	ТиповыеАнкетыВопросыАнкеты.Раздел КАК Раздел,
	|	ВариантыОтветовОпросов.Наименование,
	|	ТиповыеАнкетыВопросыАнкеты.Вопрос.ПолнаяФормулировка КАК ПолнаяФормулировка,
	|	ВариантыОтветовОпросов.ТребуетРазвернутыйОтвет,
	|	ТиповыеАнкетыВопросыАнкеты.Вопрос.Представление,
	|	ТиповыеАнкетыВопросыАнкеты.Вопрос.Код КАК КодВопроса,
	|	ТиповыеАнкетыВопросыАнкеты.Вопрос.ТипЗначения,
	|	ТиповыеАнкетыВопросыАнкеты.Вопрос.ТипОтветаНаВопрос,
	|	ТиповыеАнкетыВопросыАнкеты.Вопрос.ВидКонтактнойИнформации,
	|	ВариантыОтветовОпросов.Представление КАК ВариантОтветаПредставление,
	|	ТиповыеАнкетыВопросыАнкеты.НомерСтроки КАК НомерСтрокиВАнкете,
	|	ВариантыОтветовОпросов.Код КАК КодВариантаОтвета,
	|	ВопросыДляАнкетированияКолонкиТаблицы.НомерСтроки КАК НомерКолонки,
	|	ВопросыДляАнкетированияКолонкиТаблицы.КолонкаТаблицы,
	|	ТиповыеАнкетыВопросыАнкеты.Вопрос.КоличествоСтрокТаблицы,
	|	ВопросыДляАнкетированияКолонкиТаблицы.КолонкаТаблицы.Представление
	|ИЗ
	|	Справочник.ТиповыеАнкеты.ВопросыАнкеты КАК ТиповыеАнкетыВопросыАнкеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтветовОпросов КАК ВариантыОтветовОпросов
	|		ПО ТиповыеАнкетыВопросыАнкеты.Вопрос = ВариантыОтветовОпросов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВопросыДляАнкетирования.КолонкиТаблицы КАК ВопросыДляАнкетированияКолонкиТаблицы
	|		ПО ТиповыеАнкетыВопросыАнкеты.Вопрос = ВопросыДляАнкетированияКолонкиТаблицы.Ссылка
	|ГДЕ
	|	ТиповыеАнкетыВопросыАнкеты.Ссылка = &ТиповаяАнкета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиВАнкете
	|ИТОГИ
	|	МАКСИМУМ(НомерСтрокиВАнкете)
	|ПО
	|	Раздел,
	|	Вопрос";
	
	МакетАнкетыДляПечати = ПолучитьМакет("ТиповаяАнкета");
	ДокументМакет.Очистить();
	
	МакетАнкетыДляПечати.Области.ИмяАнкеты.Текст	= ?(НаименованиеАнкеты = "", Наименование, НаименованиеАнкеты);
	МакетАнкетыДляПечати.Области.Вступление.Текст	= Вступление;
	
	ДокументМакет.ВставитьОбласть(МакетАнкетыДляПечати.Области.Заголовок, 		ДокументМакет.Область("R1C1"), , Ложь);
	
	ДокументМакет.ВставитьОбласть(МакетАнкетыДляПечати.Области.КонтактнаяИнформация, ДокументМакет.Область("R4C1"), , Ложь);
	
	НомерСтрокиВМакете		= 10;
	Результат				= Запрос.Выполнить();
	ВыборкаЗапросаПоРазделам= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Раздел");
	Пока ВыборкаЗапросаПоРазделам.Следующий() Цикл
		ОбластьРаздел = МакетАнкетыДляПечати.Область("R13");//МакетАнкетыДляПечати.Области.ВариантОтвета;
		ДокументМакет.ВставитьОбласть(ОбластьРаздел, ДокументМакет.Область("R"+НомерСтрокиВМакете+"C1"), , Истина);
		
		Если ВыборкаЗапросаПоРазделам.Раздел = Справочники.РазделыАнкеты.ПустаяСсылка() тогда
			НаименованиеРаздела = "";
			
		Иначе
			НаименованиеРаздела = Строка(ВыборкаЗапросаПоРазделам.Раздел.Код) + ". " + ВыборкаЗапросаПоРазделам.Раздел.Наименование;
			
		КонецЕсли;
		
		ДокументМакет.Область("R"+НомерСтрокиВМакете+"C1").Текст 	= НаименованиеРаздела;
		НомерСтрокиВМакете = НомерСтрокиВМакете + 1;
		ВыборкаЗапросаПоВопросам = ВыборкаЗапросаПоРазделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Вопрос");
		Пока ВыборкаЗапросаПоВопросам.Следующий() Цикл
				
			ОбластьВопрос 			= МакетАнкетыДляПечати.Область("R10");
			ОбластьТиповойОтвет 	= МакетАнкетыДляПечати.Область("R11");
			ОбластьВариантОтвета 	= МакетАнкетыДляПечати.Область("R12");
				
			ДокументМакет.ВставитьОбласть(ОбластьВопрос, ДокументМакет.Область("R"+НомерСтрокиВМакете+"C1"), , Истина);
			ДокументМакет.Область("R"+НомерСтрокиВМакете+"C1").Текст 	= "№" + ВыборкаЗапросаПоВопросам.НомерСтрокиВАнкете + ". " + ?(ВыборкаЗапросаПоВопросам.ПолнаяФормулировка = "", ВыборкаЗапросаПоВопросам.ВопросПредставление, ВыборкаЗапросаПоВопросам.ПолнаяФормулировка);
				
			Если ВыборкаЗапросаПоВопросам.ВопросТипОтветаНаВопрос = Перечисления.ТипыОтветаНаВопросАнкеты.Дата ИЛИ
				ВыборкаЗапросаПоВопросам.ВопросТипОтветаНаВопрос = Перечисления.ТипыОтветаНаВопросАнкеты.Число ИЛИ
				ВыборкаЗапросаПоВопросам.ВопросТипОтветаНаВопрос = Перечисления.ТипыОтветаНаВопросАнкеты.Строка ИЛИ
				ВыборкаЗапросаПоВопросам.ВопросТипОтветаНаВопрос = Перечисления.ТипыОтветаНаВопросАнкеты.Булево Тогда
				НомерСтрокиВМакете = НомерСтрокиВМакете + 1;
				ДокументМакет.ВставитьОбласть(ОбластьТиповойОтвет, ДокументМакет.Область("R"+НомерСтрокиВМакете+"C1"), , Ложь);
				ДокументМакет.Область("R"+НомерСтрокиВМакете+"C2").Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				ДокументМакет.Область("R"+НомерСтрокиВМакете+"C2").Параметр	= "ТиповойОтвет" + ВыборкаЗапросаПоВопросам.КодВопроса;
				
			ИначеЕсли ВыборкаЗапросаПоВопросам.ВопросТипОтветаНаВопрос = Перечисления.ТипыОтветаНаВопросАнкеты.ОдинИзВариантовОтвета или 
				ВыборкаЗапросаПоВопросам.ВопросТипОтветаНаВопрос = Перечисления.ТипыОтветаНаВопросАнкеты.НесколькоВариантовОтвета тогда
				ВыборкаЗапросаПоВариантамОтвета = ВыборкаЗапросаПоВопросам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "");
				Пока ВыборкаЗапросаПоВариантамОтвета.Следующий() Цикл
					НомерСтрокиВМакете = НомерСтрокиВМакете + 1;
					ДокументМакет.ВставитьОбласть(ОбластьВариантОтвета, ДокументМакет.Область("R"+НомерСтрокиВМакете+"C1"), , Ложь);
					ДокументМакет.Область("R"+НомерСтрокиВМакете+"C2").Имя = "Вопрос" + ВыборкаЗапросаПоВариантамОтвета.КодВопроса + "ВариантОтвета" + ВыборкаЗапросаПоВариантамОтвета.КодВариантаОтвета;
					ДокументМакет.Область("R"+НомерСтрокиВМакете+"C3").Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
					ДокументМакет.Область("R"+НомерСтрокиВМакете+"C3").Параметр	= ВыборкаЗапросаПоВариантамОтвета.ВариантОтветаПредставление;
				КонецЦикла;
				
			ИначеЕсли ВыборкаЗапросаПоВопросам.ВопросТипОтветаНаВопрос = Перечисления.ТипыОтветаНаВопросАнкеты.Табличный тогда
				ВыборкаЗапросаПоКолонкамТаблицы = ВыборкаЗапросаПоВопросам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "");
				// формируем шапку таблицы
				НомерСтрокиВМакете = НомерСтрокиВМакете + 1;
				НомерКолонки = 0;
				НомерКолонкиМакетаЛев = 0;
				НомерКолонкиМакетаПрав = 1;
				Пока ВыборкаЗапросаПоКолонкамТаблицы.Следующий() Цикл
					ОбластьШаблонКолонки = МакетАнкетыДляПечати.Область("R13C3");//МакетАнкетыДляПечати.Области.ШаблонКолонки;
					НомерКолонки = НомерКолонки + 1;
					НомерКолонкиМакетаЛев = НомерКолонкиМакетаЛев + 1;
					НомерКолонкиМакетаПрав = НомерКолонкиМакетаПрав + 1;
					Если НомерКолонкиМакетаЛев = 2 тогда
						НомерКолонкиМакетаЛев = НомерКолонкиМакетаЛев + 1;
					КонецЕсли;
					Если НомерКолонкиМакетаПрав = 1 тогда
						НомерКолонкиМакетаПрав = НомерКолонкиМакетаПрав + 1;
					КонецЕсли;
					ОбластьШаблонКолонкиДокумент					= ДокументМакет.Область("R"+НомерСтрокиВМакете+"C"+НомерКолонкиМакетаЛев+":R"+НомерСтрокиВМакете+"C"+НомерКолонкиМакетаПрав);
					ОбластьШаблонКолонкиДокумент.Объединить();
					ОбластьШаблонКолонкиДокумент.Текст				= ВыборкаЗапросаПоКолонкамТаблицы.КолонкаТаблицыПредставление;
					ОбластьШаблонКолонкиДокумент.Имя				= "Вопрос" + ВыборкаЗапросаПоКолонкамТаблицы.КодВопроса + "КолонкаТаблицы" + НомерКолонки;
					ОбластьШаблонКолонкиДокумент.Шрифт				= ОбластьШаблонКолонки.Шрифт;
					ОбластьШаблонКолонкиДокумент.РазмещениеТекста	= ТипРазмещенияТекстаТабличногоДокумента.Переносить;
					ЛинияРамки = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
					ОбластьШаблонКолонкиДокумент.ГраницаСлева	= ЛинияРамки;
					ОбластьШаблонКолонкиДокумент.ГраницаСправа	= ЛинияРамки;
					ОбластьШаблонКолонкиДокумент.ГраницаСверху	= ЛинияРамки;
					ОбластьШаблонКолонкиДокумент.ГраницаСнизу	= ЛинияРамки;
				КонецЦикла;
				// формируем строки таблицы
				КоличествоСтрокТаблицы = ВыборкаЗапросаПоВопросам.ВопросКоличествоСтрокТаблицы;
				НомерШапкиВМакете = НомерСтрокиВМакете;
				Для индСтрокиТаблицы = 1 По КоличествоСтрокТаблицы Цикл
					ОбластьШаблонСтрокиТаблицыДокумент	= ДокументМакет.ПолучитьОбласть("R"+НомерШапкиВМакете);
					ОбластиСтрокиТаблицы = ОбластьШаблонСтрокиТаблицыДокумент.Области;
					индОбласти = 0;
					МассивОбластей = Новый Массив();
					Для Каждого ОбластьСтрокиТаблицы Из ОбластиСтрокиТаблицы Цикл
						МассивОбластей.Добавить(ОбластьСтрокиТаблицы);
					КонецЦикла;
					Для Каждого ОбластьСтрокиТаблицы Из МассивОбластей Цикл
						ИмяОбласти = ОбластьСтрокиТаблицы.Имя;
						Если Найти(ИмяОбласти, "Строка") > 0 Тогда
							Продолжить;
						КонецЕсли;
						ИмяОбласти = СтрЗаменить(ИмяОбласти, "КолонкаТаблицы", "ОтветТаблицы");
						ИмяОбласти = ИмяОбласти+"Строка"+индСтрокиТаблицы;
						ОбластьСтрокиТаблицы.Текст		= "";
						ОбластьСтрокиТаблицы.Заполнение	= ТипЗаполненияОбластиТабличногоДокумента.Параметр;
						ОбластьСтрокиТаблицы.Параметр	= ИмяОбласти;
					КонецЦикла;
					НомерСтрокиВМакете		= НомерСтрокиВМакете + 1;
					ОбластьСтрокаТаблицы	= ОбластьШаблонСтрокиТаблицыДокумент.Область("R1");
					ДокументМакет.ВставитьОбласть(ОбластьСтрокаТаблицы, ДокументМакет.Область("R"+НомерСтрокиВМакете+"C1"), , Ложь);
				КонецЦикла;
				НомерСтрокиВМакете = НомерСтрокиВМакете + 1;
				
			Иначе
				НомерСтрокиВМакете = НомерСтрокиВМакете + 1;
				ДокументМакет.ВставитьОбласть(ОбластьТиповойОтвет, ДокументМакет.Область("R"+НомерСтрокиВМакете+"C1"), , Ложь);
				ДокументМакет.Область("R"+НомерСтрокиВМакете+"C2").Параметр	= "ТиповойОтвет" + ВыборкаЗапросаПоВопросам.КодВопроса;
				
			КонецЕсли;
				
			НомерСтрокиВМакете = НомерСтрокиВМакете + 1;
		КонецЦикла;
	КонецЦикла; // по разделам
	
	ДокументМакет.Область("C2").ШиринаКолонки = 3;
	
	ПараметрыМакета = ДокументМакет.Параметры;
	
	Возврат ДокументМакет;
	
КонецФункции // СформироватьМакет()

// Восстанавливает сохраненный ранее макет анкеты
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Табличный документ, содержащий последний сохраненный вариант анкеты .
//
Функция ВосстановитьМакет() Экспорт
		
	ТабличныйДокумент = МакетАнкеты.Получить();
		
	Если ТипЗнч(ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
		Возврат ТабличныйДокумент;
		
	Иначе
		Возврат Новый ТабличныйДокумент;
		
	КонецЕсли;
		
КонецФункции // ВосстановитьМакет()

// Сохраняет макет анкеты
//
Процедура СохранитьМакет(ТабличныйДокумент) Экспорт
		
	НовыйТабДок = Новый ТабличныйДокумент();
	НовыйТабДок.ВставитьОбласть(ТабличныйДокумент.Область(), НовыйТабДок.Область(), , Ложь);
		
	МакетАнкеты = Новый ХранилищеЗначения(НовыйТабДок, Новый СжатиеДанных());
		
КонецПроцедуры // СохранитьМакет()

// Процедура выводит на экран печатную форму анкеты
//
// Параметры:
//	Нет
//
// Возвращаемое значение:
//	Нет.
//
Процедура Печать() Экспорт
		
	ПечатныйДокумент = Новый ТабличныйДокумент;
	ПечатныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТиповыеАнкеты";
	ПечатныйДокумент.Вывести(ВосстановитьМакет());
	
	// если макет еще был заполнен - сформируем его по умолчанию
	Если ПечатныйДокумент.ВысотаТаблицы = 0 Тогда
		ПечДок = Новый ТабличныйДокумент;
		СформироватьМакет(ПечДок);
		ПечатныйДокумент.Вывести(ПечДок);
	КонецЕсли;
	
	ПечатныйДокумент.Автомасштаб = Истина;
	//УниверсальныеМеханизмы.НапечататьДокумент(ПечатныйДокумент,,,);
	
КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",1);
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Возврат спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	Возврат Истина;
КонецФункции

// Обработка изменения реквизитов справочников
// Параметры
//  Имя			– Строка			– Имя реквизита справочника с полным путем.
//  ЭтаФорма	– Форма				– Ссылка на форму справочника. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части справочника, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
КонецФункции // ОбработкаРеквизита()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
//
Процедура ОбработкаЗаполнения(Основание)
	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик копирования объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ спПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПередЗаписью элемента справочника
//
Процедура ПередЗаписью(Отказ)
	Если НЕ спПередЗаписью(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПриЗаписи элемента справочника
//
Процедура ПриЗаписи(Отказ)
	Если НЕ спПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПередУдалением элемента
//
Процедура ПередУдалением(Отказ)
	Если НЕ спПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПриУстановкеНовогоКода элемента
//
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
